kaibroomfield314/Baby-Oriented-Nutrient-Dispenser--BOND-/1.Pill_Dispenser_ESP32/HardwareController.h
#ifndef HARDWARE_CONTROLLER_H
#define HARDWARE_CONTROLLER_H

#include <Arduino.h>
#include <ESP32Servo.h>
#include "Config.h"
#include "ConfigurationSettings.h"

/**
 * HardwareController Class
 * 
 * Responsible for all hardware actuation including:
 * - Stepper motor control (precise positioning and continuous rotation)
 * - Servo motor positioning
 * - Electromagnet activation
 * 
 * This class provides low-level hardware control without knowledge of
 * higher-level operations like "dispensing" or "homing" (low coupling).
 */
class HardwareController {
private:
    SystemConfiguration* systemConfiguration;
    Servo dispenserServoMotor;
    bool isElectromagnetCurrentlyActivated;
    
public:
    /**
     * Constructor
     * @param config Pointer to system configuration
     */
    HardwareController(SystemConfiguration* config) {
        systemConfiguration = config;
        isElectromagnetCurrentlyActivated = false;
    }
    
    /**
     * Initialize all hardware actuator pins and attach servo
     */
    void initializeAllHardwareActuators() {
        Serial.println("========================================");
        Serial.println("[Stepper DEBUG] INITIALIZING HARDWARE");
        Serial.println("========================================");
        
        // Configure stepper motor control pins
        pinMode(PIN_FOR_STEPPER_DIR, OUTPUT);
        pinMode(PIN_FOR_STEPPER_STEP, OUTPUT);
        pinMode(PIN_FOR_STEPPER_EN, OUTPUT);
        
        Serial.println("[Stepper DEBUG] Stepper pins configured as OUTPUT:");
        Serial.print("[Stepper DEBUG]   DIR pin (D16): ");
        Serial.println(PIN_FOR_STEPPER_DIR);
        Serial.print("[Stepper DEBUG]   STEP pin (D17): ");
        Serial.println(PIN_FOR_STEPPER_STEP);
        Serial.print("[Stepper DEBUG]   EN pin (D18): ");
        Serial.println(PIN_FOR_STEPPER_EN);
        
        // Initialize stepper motor pins (disabled by default)
        digitalWrite(PIN_FOR_STEPPER_DIR, LOW);
        digitalWrite(PIN_FOR_STEPPER_STEP, LOW);
        digitalWrite(PIN_FOR_STEPPER_EN, HIGH);  // HIGH = disabled (typical stepper driver logic)
        
        Serial.println("[Stepper DEBUG] Initial pin states set:");
        Serial.println("[Stepper DEBUG]   DIR: LOW");
        Serial.println("[Stepper DEBUG]   STEP: LOW");
        Serial.println("[Stepper DEBUG]   EN: HIGH (DISABLED)");
        
        // Verify pin states
        int dirState = digitalRead(PIN_FOR_STEPPER_DIR);
        int stepState = digitalRead(PIN_FOR_STEPPER_STEP);
        int enState = digitalRead(PIN_FOR_STEPPER_EN);
        
        Serial.print("[Stepper DEBUG] Verified pin states - DIR:");
        Serial.print(dirState);
        Serial.print(" STEP:");
        Serial.print(stepState);
        Serial.print(" EN:");
        Serial.print(enState);
        Serial.println();
        
        // Reset step counter
        resetStepCounter();
        
        // Configure electromagnet control pin
        pinMode(PIN_FOR_ELECTROMAGNET_CONTROL, OUTPUT);
        digitalWrite(PIN_FOR_ELECTROMAGNET_CONTROL, LOW);
        
        // Configure status LED
        pinMode(PIN_FOR_GREEN_STATUS_LED, OUTPUT);
        digitalWrite(PIN_FOR_GREEN_STATUS_LED, LOW);
        
        // Attach and initialize servo with min/max microseconds (from test code)
        int minSafe = getServoMinSafe();
        int maxSafe = getServoMaxSafe();
        dispenserServoMotor.attach(PIN_FOR_SERVO_MOTOR_SIGNAL, minSafe, maxSafe);
        moveServoToRestPosition();
        
        Serial.println("[Stepper DEBUG] Hardware initialization complete");
        Serial.println("========================================");
        Serial.println("Hardware actuators initialized");
    }
    
    // ========================================================================
    // Stepper Motor Control Methods
    // ========================================================================
    
    /**
     * Validate and constrain step pulse width to safe limits
     * @param pulseWidthMicroseconds Requested pulse width in microseconds
     * @return Validated pulse width within safe limits
     */
    int validateStepPulseWidth(int pulseWidthMicroseconds) {
        int minWidth = systemConfiguration->stepperMinStepPulseWidthMicroseconds;
        int maxWidth = systemConfiguration->stepperMaxStepPulseWidthMicroseconds;
        
        int validatedWidth = constrain(pulseWidthMicroseconds, minWidth, maxWidth);
        
        if (validatedWidth != pulseWidthMicroseconds) {
            Serial.print("[Stepper DEBUG] Step pulse width ");
            Serial.print(pulseWidthMicroseconds);
            Serial.print(" μs adjusted to ");
            Serial.print(validatedWidth);
            Serial.print(" μs (limits: ");
            Serial.print(minWidth);
            Serial.print("-");
            Serial.print(maxWidth);
            Serial.println(" μs)");
        }
        
        return validatedWidth;
    }
    
    /**
     * Validate and constrain step delay to safe limits (legacy function, kept for compatibility)
     * With symmetric pulse timing, this validates the pulse width instead
     * @param stepDelayMicroseconds Requested delay in microseconds
     * @return Validated delay within safe limits (for compatibility, but not used directly)
     */
    int validateStepDelay(int stepDelayMicroseconds) {
        // With symmetric pulse timing, validate the pulse width instead
        // Delay is 2 × pulse width, so we validate pulse width = delay / 2
        int pulseWidth = stepDelayMicroseconds / 2;
        int validatedWidth = validateStepPulseWidth(pulseWidth);
        return validatedWidth * 2;  // Return as delay for compatibility
    }
    
    /**
     * Calculate number of steps needed for a given angle in degrees
     * @param angleInDegrees Target angle (can be > 360 for multiple rotations)
     * @return Number of steps needed
     */
    long calculateStepsForAngle(float angleInDegrees) {
        // Calculate total steps per revolution with microstepping and gear ratio
        int baseSteps = systemConfiguration->stepperStepsPerRevolution;
        int microstepping = systemConfiguration->stepperMicrostepping;
        float gearRatio = systemConfiguration->stepperGearRatio;
        float totalStepsPerRevolution = baseSteps * microstepping * gearRatio;
        
        // Calculate steps for given angle
        long steps = (long)((angleInDegrees / 360.0) * totalStepsPerRevolution);
        
        Serial.print("[Stepper DEBUG] Angle ");
        Serial.print(angleInDegrees);
        Serial.print("° → ");
        Serial.print(steps);
        Serial.print(" steps (baseSteps=");
        Serial.print(baseSteps);
        Serial.print(", microstepping=");
        Serial.print(microstepping);
        Serial.print(", gearRatio=");
        Serial.print(gearRatio);
        Serial.print(", totalSteps/rev=");
        Serial.print(totalStepsPerRevolution);
        Serial.println(")");
        
        return steps;
    }
    
    // Step counter for debugging (reset before operations)
    static unsigned long stepPulseCount;
    
    /**
     * Generate a single step pulse
     * STEP pin: HIGH→LOW transition triggers step on most stepper drivers
     * Uses symmetric pulse timing (like test code): HIGH for step_us, LOW for step_us
     * This provides slower, smoother movement compared to fast pulses with delays
     */
    void generateStepPulse() {
        stepPulseCount++;
        
        // Log every 100th step to avoid flooding serial output
        if (stepPulseCount % 100 == 0) {
            Serial.print("[Stepper DEBUG] Step pulse #");
            Serial.print(stepPulseCount);
            Serial.print(" - STEP pin: HIGH");
            Serial.flush();
        }
        
        // Symmetric pulse timing (integrated from test code)
        // HIGH for step_us microseconds, then LOW for step_us microseconds
        int stepPulseWidth = systemConfiguration->stepperStepPulseWidthMicroseconds;
        
