kaibroomfield314/Baby-Oriented-Nutrient-Dispenser--BOND-/1.Pill_Dispenser_ESP32/HardwareController.h
        digitalWrite(PIN_FOR_STEPPER_STEP, HIGH);
        delayMicroseconds(stepPulseWidth);
        digitalWrite(PIN_FOR_STEPPER_STEP, LOW);
        
        if (stepPulseCount % 100 == 0) {
            Serial.print(" → LOW (pulse width: ");
            Serial.print(stepPulseWidth);
            Serial.println(" μs)");
        }
        
        delayMicroseconds(stepPulseWidth);  // Symmetric LOW time
    }
    
    /**
     * Reset step pulse counter (call before starting a new movement)
     */
    void resetStepCounter() {
        stepPulseCount = 0;
        Serial.println("[Stepper DEBUG] Step counter reset");
    }
    
    /**
     * Enable stepper motor (prepare for movement)
     * @param directionForward true for forward, false for backward
     */
    void enableStepperMotor(bool directionForward) {
        Serial.println("========================================");
        Serial.println("[Stepper DEBUG] ENABLING MOTOR");
        Serial.println("========================================");
        
        // Set direction first (before enabling)
        int dirPinState = directionForward ? HIGH : LOW;
        digitalWrite(PIN_FOR_STEPPER_DIR, dirPinState);
        delayMicroseconds(5);  // Small delay for direction to settle
        
        Serial.print("[Stepper DEBUG] DIR pin (D16) set to: ");
        Serial.print(dirPinState == HIGH ? "HIGH" : "LOW");
        Serial.print(" (");
        Serial.print(directionForward ? "FORWARD/clockwise" : "BACKWARD/anticlockwise");
        Serial.println(")");
        
        // Enable stepper motor (LOW = enabled for most drivers)
        // If your driver uses HIGH = enabled, invert this logic
        digitalWrite(PIN_FOR_STEPPER_EN, LOW);
        
        // Small delay to ensure signals are stable
        delayMicroseconds(10);
        
        Serial.print("[Stepper DEBUG] EN pin (D18) set to: LOW (ENABLED)");
        Serial.println();
        Serial.print("[Stepper DEBUG] STEP pin (D17) ready for pulses");
        Serial.println();
        
        // Read actual pin states for verification
        int actualDir = digitalRead(PIN_FOR_STEPPER_DIR);
        int actualEn = digitalRead(PIN_FOR_STEPPER_EN);
        int actualStep = digitalRead(PIN_FOR_STEPPER_STEP);
        
        Serial.print("[Stepper DEBUG] Pin states verified - DIR:");
        Serial.print(actualDir);
        Serial.print(" EN:");
        Serial.print(actualEn);
        Serial.print(" STEP:");
        Serial.print(actualStep);
        Serial.println();
        
        Serial.println("[Stepper DEBUG] Motor enabled and ready for stepping");
        Serial.println("========================================");
    }
    
    /**
     * Generate a step pulse with timing (for continuous rotation loops)
     * With symmetric pulse timing, generateStepPulse() already handles the timing,
     * so this function just calls it (no additional delay needed)
     * @param stepDelay Not used with symmetric pulse timing (kept for compatibility)
     */
    void stepWithDelay(int stepDelay) {
        // With symmetric pulse timing, the delay is built into generateStepPulse()
        // Each step takes: stepPulseWidth HIGH + stepPulseWidth LOW = 2 × stepPulseWidth
        generateStepPulse();
        
        // Log every 1000 steps for continuous rotation
        if (stepPulseCount % 1000 == 0 && stepPulseCount > 0) {
            Serial.print("[Stepper DEBUG] Continuous rotation: ");
            Serial.print(stepPulseCount);
            Serial.print(" steps completed, pulse width=");
            Serial.print(systemConfiguration->stepperStepPulseWidthMicroseconds);
            Serial.println(" μs");
        }
    }
    
    /**
     * Rotate stepper motor forward by a specific angle
     * @param angleInDegrees Angle to rotate (can be > 360 for multiple rotations)
     * @param stepDelayMicroseconds Delay between step pulses in microseconds (lower = faster)
     */
    void rotateStepperForwardByAngle(float angleInDegrees, int stepDelayMicroseconds) {
        Serial.println("========================================");
        Serial.println("[Stepper DEBUG] STARTING FORWARD ROTATION");
        Serial.println("========================================");
        
        resetStepCounter();
        
        // Enable stepper motor
        enableStepperMotor(true);  // true = forward
        
        // Calculate steps (symmetric pulse timing built into generateStepPulse)
        long steps = calculateStepsForAngle(angleInDegrees);
        
        Serial.print("[Stepper DEBUG] Movement parameters: ");
        Serial.print(angleInDegrees);
        Serial.print("°, ");
        Serial.print(steps);
        Serial.print(" steps, pulse width ");
        Serial.print(systemConfiguration->stepperStepPulseWidthMicroseconds);
        Serial.println(" μs");
        
        Serial.println("[Stepper DEBUG] Starting step pulse generation...");
        
        // Generate step pulses (symmetric timing built into generateStepPulse)
        unsigned long startTime = millis();
        for (long i = 0; i < steps; i++) {
            generateStepPulse();  // Includes symmetric HIGH/LOW timing
            
            // Log progress every 10% or every 100 steps
            if ((i + 1) % 100 == 0 || (i + 1) == steps || (steps > 10 && (i + 1) % (steps / 10) == 0)) {
                float progress = ((float)(i + 1) / steps) * 100.0;
                Serial.print("[Stepper DEBUG] Progress: ");
                Serial.print(progress);
                Serial.print("% (");
                Serial.print(i + 1);
                Serial.print("/");
                Serial.print(steps);
                Serial.println(" steps)");
            }
        }
        
        unsigned long elapsed = millis() - startTime;
        Serial.print("[Stepper DEBUG] Completed ");
        Serial.print(steps);
        Serial.print(" steps in ");
        Serial.print(elapsed);
        Serial.println(" ms");
        
        // Small settling delay
        delayMicroseconds(100);
        
        Serial.println("[Stepper DEBUG] Forward rotation complete");
        Serial.println("========================================");
    }
    
    /**
     * Move stepper motor forward by exact number of steps
     * @param steps Number of steps to move (positive = forward)
     * @param stepDelayMicroseconds Delay between step pulses in microseconds
     * @return Number of steps actually moved
     */
    long moveStepperForwardBySteps(long steps, int stepDelayMicroseconds) {
        if (steps <= 0) {
            Serial.println("[Stepper DEBUG] No forward movement needed (steps <= 0)");
            return 0;
        }
        
