kaibroomfield314/Baby-Oriented-Nutrient-Dispenser--BOND-/1.Pill_Dispenser_ESP32/HardwareController.h
        Serial.println("========================================");
        Serial.println("[Stepper DEBUG] STARTING FORWARD MOVEMENT BY STEPS");
        Serial.println("========================================");
        
        resetStepCounter();
        
        // Enable stepper motor
        enableStepperMotor(true);  // true = forward
        
        Serial.print("[Stepper DEBUG] Movement: ");
        Serial.print(steps);
        Serial.print(" steps forward, pulse width ");
        Serial.print(systemConfiguration->stepperStepPulseWidthMicroseconds);
        Serial.println(" μs");
        
        Serial.println("[Stepper DEBUG] Starting step pulse generation...");
        
        // Generate step pulses (symmetric timing built into generateStepPulse)
        unsigned long startTime = millis();
        for (long i = 0; i < steps; i++) {
            generateStepPulse();  // Includes symmetric HIGH/LOW timing
            
            // Log progress every 100 steps
            if ((i + 1) % 100 == 0 || (i + 1) == steps) {
                float progress = ((float)(i + 1) / steps) * 100.0;
                Serial.print("[Stepper DEBUG] Progress: ");
                Serial.print(progress);
                Serial.print("% (");
                Serial.print(i + 1);
                Serial.print("/");
                Serial.print(steps);
                Serial.println(" steps)");
            }
        }
        
        unsigned long elapsed = millis() - startTime;
        Serial.print("[Stepper DEBUG] Completed ");
        Serial.print(steps);
        Serial.print(" steps forward in ");
        Serial.print(elapsed);
        Serial.println(" ms");
        
        delayMicroseconds(100);
        
        Serial.println("[Stepper DEBUG] Forward movement complete");
        Serial.println("========================================");
        
        return steps;  // Return steps moved (positive for forward)
    }
    
    /**
     * Move stepper motor backward by exact number of steps
     * @param steps Number of steps to move (positive value, will move backward)
     * @param stepDelayMicroseconds Delay between step pulses in microseconds
     * @return Number of steps actually moved (negative for backward)
     */
    long moveStepperBackwardBySteps(long steps, int stepDelayMicroseconds) {
        if (steps <= 0) {
            Serial.println("[Stepper DEBUG] No backward movement needed (steps <= 0)");
            return 0;
        }
        
        Serial.println("========================================");
        Serial.println("[Stepper DEBUG] STARTING BACKWARD MOVEMENT BY STEPS");
        Serial.println("========================================");
        
        resetStepCounter();
        
        // Enable stepper motor
        enableStepperMotor(false);  // false = backward
        
        Serial.print("[Stepper DEBUG] Movement: ");
        Serial.print(steps);
        Serial.print(" steps backward, pulse width ");
        Serial.print(systemConfiguration->stepperStepPulseWidthMicroseconds);
        Serial.println(" μs");
        
        Serial.println("[Stepper DEBUG] Starting step pulse generation...");
        
        // Generate step pulses (symmetric timing built into generateStepPulse)
        unsigned long startTime = millis();
        for (long i = 0; i < steps; i++) {
            generateStepPulse();  // Includes symmetric HIGH/LOW timing
            
            // Log progress every 100 steps
            if ((i + 1) % 100 == 0 || (i + 1) == steps) {
                float progress = ((float)(i + 1) / steps) * 100.0;
                Serial.print("[Stepper DEBUG] Progress: ");
                Serial.print(progress);
                Serial.print("% (");
                Serial.print(i + 1);
                Serial.print("/");
                Serial.print(steps);
                Serial.println(" steps)");
            }
        }
        
        unsigned long elapsed = millis() - startTime;
        Serial.print("[Stepper DEBUG] Completed ");
        Serial.print(steps);
        Serial.print(" steps backward in ");
        Serial.print(elapsed);
        Serial.println(" ms");
        
        delayMicroseconds(100);
        
        Serial.println("[Stepper DEBUG] Backward movement complete");
        Serial.println("========================================");
        
        return -steps;  // Return negative for backward movement
    }
    
    /**
     * Rotate stepper motor backward by a specific angle
     * @param angleInDegrees Angle to rotate (can be > 360 for multiple rotations)
     * @param stepDelayMicroseconds Delay between step pulses in microseconds (lower = faster)
     */
    void rotateStepperBackwardByAngle(float angleInDegrees, int stepDelayMicroseconds) {
        Serial.println("========================================");
        Serial.println("[Stepper DEBUG] STARTING BACKWARD ROTATION");
        Serial.println("========================================");
        
        resetStepCounter();
        
        // Enable stepper motor
        enableStepperMotor(false);  // false = backward
        
        // Calculate steps (symmetric pulse timing built into generateStepPulse)
        long steps = calculateStepsForAngle(angleInDegrees);
        
        Serial.print("[Stepper DEBUG] Movement parameters: ");
        Serial.print(angleInDegrees);
        Serial.print("°, ");
        Serial.print(steps);
        Serial.print(" steps, pulse width ");
        Serial.print(systemConfiguration->stepperStepPulseWidthMicroseconds);
        Serial.println(" μs");
        
        Serial.println("[Stepper DEBUG] Starting step pulse generation...");
        
        // Generate step pulses (symmetric timing built into generateStepPulse)
        unsigned long startTime = millis();
        for (long i = 0; i < steps; i++) {
            generateStepPulse();  // Includes symmetric HIGH/LOW timing
            
            // Log progress every 10% or every 100 steps
            if ((i + 1) % 100 == 0 || (i + 1) == steps || (steps > 10 && (i + 1) % (steps / 10) == 0)) {
                float progress = ((float)(i + 1) / steps) * 100.0;
                Serial.print("[Stepper DEBUG] Progress: ");
                Serial.print(progress);
                Serial.print("% (");
                Serial.print(i + 1);
                Serial.print("/");
                Serial.print(steps);
                Serial.println(" steps)");
            }
        }
        
        unsigned long elapsed = millis() - startTime;
        Serial.print("[Stepper DEBUG] Completed ");
        Serial.print(steps);
        Serial.print(" steps in ");
        Serial.print(elapsed);
        Serial.println(" ms");
        
