kaibroomfield314/Baby-Oriented-Nutrient-Dispenser--BOND-/1.Pill_Dispenser_ESP32/HardwareController.h
        // Small settling delay
        delayMicroseconds(100);
        
        Serial.println("[Stepper DEBUG] Backward rotation complete");
        Serial.println("========================================");
    }
    
    /**
     * Rotate stepper motor forward continuously (for homing - until stopped externally)
     * Note: Call enableStepperMotor(true) once before the loop, then call this repeatedly
     * @param stepDelayMicroseconds Delay between step pulses in microseconds (lower = faster)
     */
    void rotateStepperForwardContinuous(int stepDelayMicroseconds) {
        // Validate delay (only log first time to avoid flooding)
        static int lastLoggedDelay = -1;
        int validatedDelay = validateStepDelay(stepDelayMicroseconds);
        
        if (stepDelayMicroseconds != lastLoggedDelay) {
            Serial.print("[Stepper DEBUG] Continuous FORWARD rotation - delay: ");
            Serial.print(validatedDelay);
            Serial.println(" μs");
            lastLoggedDelay = stepDelayMicroseconds;
        }
        
        // Generate step pulse with proper timing
        stepWithDelay(validatedDelay);
    }
    
    /**
     * Rotate stepper motor backward continuously (for homing - until stopped externally)
     * Note: Call enableStepperMotor(false) once before the loop, then call this repeatedly
     * @param stepDelayMicroseconds Delay between step pulses in microseconds (lower = faster)
     */
    void rotateStepperBackwardContinuous(int stepDelayMicroseconds) {
        // Validate delay (only log first time to avoid flooding)
        static int lastLoggedDelay = -1;
        int validatedDelay = validateStepDelay(stepDelayMicroseconds);
        
        if (stepDelayMicroseconds != lastLoggedDelay) {
            Serial.print("[Stepper DEBUG] Continuous BACKWARD rotation - delay: ");
            Serial.print(validatedDelay);
            Serial.println(" μs");
            lastLoggedDelay = stepDelayMicroseconds;
        }
        
        // Generate step pulse with proper timing
        stepWithDelay(validatedDelay);
    }
    
    /**
     * Stop the stepper motor immediately (disable motor)
     */
    void stopMotorCompletely() {
        Serial.println("========================================");
        Serial.println("[Stepper DEBUG] STOPPING MOTOR");
        Serial.println("========================================");
        
        Serial.print("[Stepper DEBUG] Total steps generated before stop: ");
        Serial.println(stepPulseCount);
        
        // Disable stepper motor (HIGH = disabled)
        digitalWrite(PIN_FOR_STEPPER_EN, HIGH);
        
        // Ensure STEP pin is LOW
        digitalWrite(PIN_FOR_STEPPER_STEP, LOW);
        
        // Read pin states for verification
        int actualEn = digitalRead(PIN_FOR_STEPPER_EN);
        int actualStep = digitalRead(PIN_FOR_STEPPER_STEP);
        int actualDir = digitalRead(PIN_FOR_STEPPER_DIR);
        
        Serial.print("[Stepper DEBUG] Pin states after stop - EN:");
        Serial.print(actualEn);
        Serial.print(" (should be HIGH=disabled) STEP:");
        Serial.print(actualStep);
        Serial.print(" (should be LOW) DIR:");
        Serial.print(actualDir);
        Serial.println();
        
        Serial.println("[Stepper DEBUG] Motor disabled and stopped");
        Serial.println("========================================");
    }
    
    // ========================================================================
    // Legacy Motor Control Methods (mapped to stepper for compatibility)
    // NOTE: These methods are kept for backward compatibility but now use direct timing
    // ========================================================================
    
    /**
     * Set motor to rotate forward at specified step delay (for compatibility)
     * Note: This enables the motor and sets direction - use once before loop
     * @param stepDelayMicroseconds Delay between step pulses in microseconds
     */
    void setMotorToRotateForwardAtSpeed(int stepDelayMicroseconds) {
        enableStepperMotor(true);  // Enable and set forward direction
        rotateStepperForwardContinuous(stepDelayMicroseconds);
    }
    
    /**
     * Set motor to rotate backward at specified step delay (for compatibility)
     * Note: This enables the motor and sets direction - use once before loop
     * @param stepDelayMicroseconds Delay between step pulses in microseconds
     */
    void setMotorToRotateBackwardAtSpeed(int stepDelayMicroseconds) {
        enableStepperMotor(false);  // Enable and set backward direction
        rotateStepperBackwardContinuous(stepDelayMicroseconds);
    }
    
    /**
     * Run motor forward at homing speed (slower for accuracy)
     * Uses stepperHomingStepDelayMicroseconds from configuration
     */
    void runMotorAtHomingSpeed() {
        enableStepperMotor(true);
        rotateStepperForwardContinuous(systemConfiguration->stepperHomingStepDelayMicroseconds);
    }
    
    /**
     * Run motor forward at custom homing delay (for retry attempts)
     * @param stepDelayMicroseconds Custom step delay in microseconds
     */
    void runMotorAtCustomHomingSpeed(int stepDelayMicroseconds) {
        enableStepperMotor(true);
        rotateStepperForwardContinuous(stepDelayMicroseconds);
    }
    
    /**
     * Run motor forward at normal running speed
     * Uses stepperRunningStepDelayMicroseconds from configuration
     * Note: For precise positioning, use rotateStepperForwardByAngle() instead
     */
    void runMotorAtNormalSpeed() {
        enableStepperMotor(true);
        rotateStepperForwardContinuous(systemConfiguration->stepperRunningStepDelayMicroseconds);
    }
    
    // ========================================================================
    // Servo Control Methods
    // ========================================================================
    
    /**
     * Get calculated safe servo endpoints
     */
    int getServoMinSafe() {
        return systemConfiguration->servoMinMicroseconds + systemConfiguration->servoEndMarginMicroseconds;
    }
    
