kaibroomfield314/Baby-Oriented-Nutrient-Dispenser--BOND-/1.Pill_Dispenser_ESP32/HardwareController.h
    int getServoMaxSafe() {
        return systemConfiguration->servoMaxMicroseconds - systemConfiguration->servoEndMarginMicroseconds;
    }
    
    /**
     * Move servo to a specific position in microseconds (from test code)
     * @param targetMicroseconds Target position in microseconds
     */
    void moveServoToMicroseconds(int targetMicroseconds) {
        int minSafe = getServoMinSafe();
        int maxSafe = getServoMaxSafe();
        
        // Constrain to safe range
        targetMicroseconds = constrain(targetMicroseconds, minSafe, maxSafe);
        
        // Ensure servo is attached
        if (!dispenserServoMotor.attached()) {
            dispenserServoMotor.attach(PIN_FOR_SERVO_MOTOR_SIGNAL, minSafe, maxSafe);
        }
        
        // Get current position
        int current = dispenserServoMotor.readMicroseconds();
        if (current < minSafe || current > maxSafe) {
            current = minSafe;  // Clamp to known good start
            dispenserServoMotor.writeMicroseconds(current);
            delay(5);
        }
        
        // Determine step direction and size
        int step = (targetMicroseconds >= current) ? systemConfiguration->servoStepMicroseconds : -systemConfiguration->servoStepMicroseconds;
        
        // Move in steps to target position
        for (int us = current; (step > 0 ? us <= targetMicroseconds : us >= targetMicroseconds); us += step) {
            dispenserServoMotor.writeMicroseconds(us);
            delay(systemConfiguration->servoStepDelayMilliseconds);
        }
        
        Serial.print("Servo moved to: ");
        Serial.print(targetMicroseconds);
        Serial.println(" microseconds");
    }
    
    /**
     * Move servo to rest/home position (minimum position)
     */
    void moveServoToRestPosition() {
        int minSafe = getServoMinSafe();
        moveServoToMicroseconds(minSafe);
    }
    
    /**
     * Move servo to maximum position (for dispensing)
     */
    void moveServoToMaxPosition() {
        int maxSafe = getServoMaxSafe();
        moveServoToMicroseconds(maxSafe);
    }
    
    /**
     * Servo full arc sweep: min → max → min (for pill dispensing)
     * This sweeps the full range to ensure pill release
     */
    void servoFullArcSweep() {
        Serial.println("[Servo] Starting full arc sweep (min → max → min)");
        
        int minSafe = getServoMinSafe();
        int maxSafe = getServoMaxSafe();
        
        // Ensure we start at minimum
        moveServoToMicroseconds(minSafe);
        
        // Sweep to maximum
        Serial.println("[Servo] Sweeping to maximum position...");
        moveServoToMicroseconds(maxSafe);
        
        // Wait at maximum
        delay(500);
        
        // Sweep back to minimum
        Serial.println("[Servo] Sweeping back to minimum position...");
        moveServoToMicroseconds(minSafe);
        
        Serial.println("[Servo] Full arc sweep complete");
    }
    
    /**
     * Move servo to dispensing position (sweeps full arc: min → max → min)
     * This ensures pill release by sweeping the full range
     */
    void moveServoToDispensingPosition() {
        servoFullArcSweep();
    }
    
    /**
     * Move servo to dispensing position and wait for movement to complete
     */
    void moveServoToDispensingPositionAndWait() {
        moveServoToDispensingPosition();
        delay(systemConfiguration->servoMovementDelayMilliseconds);
    }
    
    /**
     * Move servo to rest position and wait for movement to complete
     */
    void moveServoToRestPositionAndWait() {
        moveServoToRestPosition();
        delay(systemConfiguration->servoMovementDelayMilliseconds);
    }
    
    // ========================================================================
    // Electromagnet Control Methods
    // ========================================================================
    
    /**
     * Activate the electromagnet to pick up pills
     */
    void activateElectromagnetForPillPickup() {
        digitalWrite(PIN_FOR_ELECTROMAGNET_CONTROL, HIGH);
        isElectromagnetCurrentlyActivated = true;
        Serial.println("Electromagnet activated");
    }
    
    /**
     * Deactivate the electromagnet to release pills
     */
    void deactivateElectromagnetToReleasePill() {
        digitalWrite(PIN_FOR_ELECTROMAGNET_CONTROL, LOW);
        isElectromagnetCurrentlyActivated = false;
        Serial.println("Electromagnet deactivated");
    }
    
    /**
     * Activate electromagnet and wait for stabilization
     */
    void activateElectromagnetAndWaitForStabilization() {
        activateElectromagnetForPillPickup();
        delay(systemConfiguration->electromagnetActivationDelayMilliseconds);
    }
    
    /**
     * Deactivate electromagnet with delay
     */
    void deactivateElectromagnetWithDelay() {
        deactivateElectromagnetToReleasePill();
        delay(systemConfiguration->electromagnetDeactivationDelayMilliseconds);
    }
    
    /**
     * Check if electromagnet is currently activated
     * @return true if electromagnet is on
     */
    bool isElectromagnetActive() {
        return isElectromagnetCurrentlyActivated;
    }
    
    // ========================================================================
    // Status LED Control Methods
    // ========================================================================
    
    /**
     * Turn on the green status LED to indicate ready state
     */
    void turnOnReadyStatusLED() {
        digitalWrite(PIN_FOR_GREEN_STATUS_LED, HIGH);
    }
    
    /**
     * Turn off the green status LED
     */
    void turnOffReadyStatusLED() {
        digitalWrite(PIN_FOR_GREEN_STATUS_LED, LOW);
    }
    
    /**
     * Toggle the status LED state
     */
    void toggleStatusLED() {
        digitalWrite(PIN_FOR_GREEN_STATUS_LED, !digitalRead(PIN_FOR_GREEN_STATUS_LED));
    }
};

// Static member definition (required for C++)
unsigned long HardwareController::stepPulseCount = 0;

#endif // HARDWARE_CONTROLLER_H

